Hi @epomatti , thanks for raising this issue. I am trying to repoduce this in my local machine. It seems ok by my experiment with your template above. Here is the output result.

```
terraform apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_batch_account.default will be created
  + resource "azurerm_batch_account" "default" {
      + account_endpoint                    = (known after apply)
      + allowed_authentication_modes        = (known after apply)
      + id                                  = (known after apply)
      + location                            = "eastus2"
      + name                                = "batch812834"
      + pool_allocation_mode                = "BatchService"
      + primary_access_key                  = (sensitive value)
      + public_network_access_enabled       = true
      + resource_group_name                 = "yunliughissuebatch"
      + secondary_access_key                = (sensitive value)
      + storage_account_authentication_mode = "BatchAccountManagedIdentity"
      + storage_account_id                  = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_profile {
          + account_access {
              + default_action = "Allow"
            }
          + node_management_access {
              + default_action = "Allow"
            }
        }
    }

  # azurerm_resource_group.default will be created
  + resource "azurerm_resource_group" "default" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "yunliughissuebatch"
    }

  # azurerm_storage_account.autostorage will be created
  + resource "azurerm_storage_account" "autostorage" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + enable_https_traffic_only          = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + location                           = "eastus2"
      + min_tls_version                    = "TLS1_2"
      + name                               = "stbatch812834autostg"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "yunliughissuebatch"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
azurerm_resource_group.default: Creating...
azurerm_resource_group.default: Creation complete after 4s [id=/subscriptions/85b3dbca-5974-4067-9669-67a141095a76/resourceGroups/yunliughissuebatch]
azurerm_storage_account.autostorage: Creating...
azurerm_storage_account.autostorage: Still creating... [10s elapsed]
azurerm_storage_account.autostorage: Still creating... [20s elapsed]
azurerm_storage_account.autostorage: Creation complete after 28s [id=/subscriptions/85b3dbca-5974-4067-9669-67a141095a76/resourceGroups/yunliughissuebatch/providers/Microsoft.Storage/storageAccounts/stbatch812834autostg]
azurerm_batch_account.default: Creating...
azurerm_batch_account.default: Still creating... [10s elapsed]
azurerm_batch_account.default: Still creating... [20s elapsed]
azurerm_batch_account.default: Creation complete after 21s [id=/subscriptions/85b3dbca-5974-4067-9669-67a141095a76/resourceGroups/yunliughissuebatch/providers/Microsoft.Batch/batchAccounts/batch812834]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
PS C:\Users\yunliu1\Documents\terraformtest\batch3> 
PS C:\Users\yunliu1\Documents\terraformtest\batch3> terraform apply -auto-approve
azurerm_resource_group.default: Refreshing state... [id=/subscriptions/85b3dbca-5974-4067-9669-67a141095a76/resourceGroups/yunliughissuebatch]
azurerm_storage_account.autostorage: Refreshing state... [id=/subscriptions/85b3dbca-5974-4067-9669-67a141095a76/resourceGroups/yunliughissuebatch/providers/Microsoft.Storage/storageAccounts/stbatch812834autostg]
azurerm_batch_account.default: Refreshing state... [id=/subscriptions/85b3dbca-5974-4067-9669-67a141095a76/resourceGroups/yunliughissuebatch/providers/Microsoft.Batch/batchAccounts/batch812834]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_batch_account.default will be updated in-place
  ~ resource "azurerm_batch_account" "default" {
        id                                  = "/subscriptions/85b3dbca-5974-4067-9669-67a141095a76/resourceGroups/yunliughissuebatch/providers/Microsoft.Batch/batchAccounts/batch812834"
        name                                = "batch812834"
      ~ tags                                = {
          + "environment" = "dev"
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
azurerm_batch_account.default: Modifying... [id=/subscriptions/85b3dbca-5974-4067-9669-67a141095a76/resourceGroups/yunliughissuebatch/providers/Microsoft.Batch/batchAccounts/batch812834]
azurerm_batch_account.default: Modifications complete after 6s [id=/subscriptions/85b3dbca-5974-4067-9669-67a141095a76/resourceGroups/yunliughissuebatch/providers/Microsoft.Batch/batchAccounts/batch812834]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
```